<?php

use Illuminate\Database\Seeder;
use App\Http\Models\IssueCategory;

class IssueCategoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        IssueCategory::insert([
            [
                'id' => 1,
                'name_ua' => 'Водовідведення, каналізація',
                'name_ru' => 'Водоотведение, канализация',
            ],
            [
                'id' => 2,
                'name_ua' => 'Водопостачання',
                'name_ru' => 'Водоснабжение',
            ],
            [
                'id' => 3,
                'name_ua' => 'Газопостачання',
                'name_ru' => 'Газоснабжение',
            ],
            [
                'id' => 4,
                'name_ua' => 'Житловий фонд',
                'name_ru' => 'Жилищный фонд',
            ],
            [
                'id' => 5,
                'name_ua' => 'Ліфти',
                'name_ru' => 'Лифты',
            ],
            [
                'id' => 6,
                'name_ua' => 'Придомова територія',
                'name_ru' => 'Придомовая территория',
            ],
            [
                'id' => 7,
                'name_ua' => 'Центральне опалення',
                'name_ru' => 'Центральное отопление',
            ],
            [
                'id' => 8,
                'name_ua' => 'Електропостачання',
                'name_ru' => 'Електроснабжение',
            ],
            [
                'id' => 9,
                'name_ua' => 'Інше',
                'name_ru' => 'Другое',
            ],
        ]);
            //
        IssueCategory::insert([
            [
                'id' => 10,
                'name_ua' => 'Засмічення системи водовідведення',
                'parent_id' => 1,
            ],
            [
                'id' => 11,
                'name_ua' => 'Відсутність люків у каналізаційних колодязях',
                'parent_id' => 1,
            ],
            [
                'id' => 12,
                'name_ua' => 'Пошкодження сантехнічних приладів і трубопроводу',
                'parent_id' => 1,
            ],
            [
                'id' => 13,
                'name_ua' => 'Пошкодження (порив, руйнування)',
                'parent_id' => 1,
            ],
            [
                'id' => 14,
                'name_ua' => 'Інше',
                'parent_id' => 1,
            ],
            //
            [
                'id' => 15,
                'name_ua' => 'Відсутність люків у каналізаційних колодязях',
                'parent_id' => 2,
            ],
            [
                'id' => 16,
                'name_ua' => 'Пошкодження сантехнічних приладів і трубопроводу',
                'parent_id' => 2,
            ],
            [
                'id' => 17,
                'name_ua' => 'Пошкодження (порив, руйнування)',
                'parent_id' => 2,
            ],
            [
                'id' => 18,
                'name_ua' => 'Інше',
                'parent_id' => 2,
            ],
            //
            [
                'id' => 19,
                'name_ua' => 'Наявність явних ознак витіку газу',
                'parent_id' => 3,
            ],
            [
                'id' => 20,
                'name_ua' => 'Незадовільний зовнішній вигляд газового обладнання',
                'parent_id' => 3,
            ],
            [
                'id' => 21,
                'name_ua' => 'Пошкодження газових приладів у квартирі',
                'parent_id' => 3,
            ],
            [
                'id' => 22,
                'name_ua' => 'Порив систем, вихід з ладу арматури',
                'parent_id' => 3,
            ],
            [
                'id' => 23,
                'name_ua' => 'Інше',
                'parent_id' => 3,
            ],
            //
            [
                'id' => 24,
                'name_ua' => 'Аварійний стан балконів, карнизів',
                'parent_id' => 4,
            ],
            [
                'id' => 25,
                'name_ua' => 'Аварійний стан козирків',
                'parent_id' => 4,
            ],
            [
                'id' => 26,
                'name_ua' => 'Аварійний стан відмостків фундамента',
                'parent_id' => 4,
            ],
            [
                'id' => 27,
                'name_ua' => 'Обвалення або роз\`єднання відсотків',
                'parent_id' => 4,
            ],
            [
                'id' => 28,
                'name_ua' => 'Пошкодження покрівлі, що загрожує обваленням',
                'parent_id' => 4,
            ],
            [
                'id' => 29,
                'name_ua' => 'Протікання покрівлі металічної',
                'parent_id' => 4,
            ],
            [
                'id' => 30,
                'name_ua' => 'Протікання покрівлі м`якої',
                'parent_id' => 4,
            ],
            [
                'id' => 31,
                'name_ua' => 'Протікання покрівлі шиферної',
                'parent_id' => 4,
            ],
            [
                'id' => 32,
                'name_ua' => 'Інше',
                'parent_id' => 4,
            ],
            //
            [
                'id' => 33,
                'name_ua' => 'Виявлення явних ознак пошкодження ліфта',
                'parent_id' => 5,
            ],
            [
                'id' => 34,
                'name_ua' => 'Обрив і падіння кабіни ліфта',
                'parent_id' => 5,
            ],
            [
                'id' => 35,
                'name_ua' => 'Зупинка ліфта з людьми',
                'parent_id' => 5,
            ],
            [
                'id' => 36,
                'name_ua' => 'Відкриті двері ліфта',
                'parent_id' => 5,
            ],
            [
                'id' => 37,
                'name_ua' => 'Відсутність огорож дверей шахти',
                'parent_id' => 5,
            ],
            [
                'id' => 38,
                'name_ua' => 'Інше',
                'parent_id' => 5,
            ],
            //
            [
                'id' => 39,
                'name_ua' => 'Необхідність обрізки гілок дерев',
                'parent_id' => 6,
            ],
            [
                'id' => 40,
                'name_ua' => 'Незадовільний технічний стан',
                'parent_id' => 6,
            ],
            [
                'id' => 41,
                'name_ua' => 'Утворення стихійних звалищ сміття',
                'parent_id' => 6,
            ],
            [
                'id' => 42,
                'name_ua' => 'Відсутність прибирання прибудинкових ділянок',
                'parent_id' => 6,
            ],
            [
                'id' => 43,
                'name_ua' => 'Стан дерев, що загрожує падінням',
                'parent_id' => 6,
            ],
            [
                'id' => 44,
                'name_ua' => 'Інше',
                'parent_id' => 6,
            ],
            //
            [
                'id' => 45,
                'name_ua' => 'Вихід з ладу вентилів',
                'parent_id' => 7,
            ],
            [
                'id' => 46,
                'name_ua' => 'Вихід з ладу регулювальних кранів',
                'parent_id' => 7,
            ],
            [
                'id' => 47,
                'name_ua' => 'Відсутність ізоляції на трубопроводі',
                'parent_id' => 7,
            ],
            [
                'id' => 48,
                'name_ua' => 'Відсутність люків на колодязях',
                'parent_id' => 7,
            ],
            [
                'id' => 49,
                'name_ua' => 'Пошкодження батарей',
                'parent_id' => 7,
            ],
            [
                'id' => 50,
                'name_ua' => 'Порив труб систем опалення у квартирі',
                'parent_id' => 7,
            ],
            [
                'id' => 51,
                'name_ua' => 'Порив трубопроводу опалення',
                'parent_id' => 7,
            ],
            [
                'id' => 52,
                'name_ua' => 'Загрозливе провисання підвішених трубопроводів',
                'parent_id' => 7,
            ],
            [
                'id' => 53,
                'name_ua' => 'Інше',
                'parent_id' => 7,
            ],
            //
            [
                'id' => 54,
                'name_ua' => 'Значні регулярні перепади напруги',
                'parent_id' => 8,
            ],
            [
                'id' => 55,
                'name_ua' => 'Іскріння оголених проводів',
                'parent_id' => 8,
            ],
            [
                'id' => 56,
                'name_ua' => 'Коротке замикання в будинковій лінії',
                'parent_id' => 8,
            ],
            [
                'id' => 57,
                'name_ua' => 'Небезпека пориву ліній електропередач',
                'parent_id' => 8,
            ],
            [
                'id' => 58,
                'name_ua' => 'Відключення (відсутність) освітлення',
                'parent_id' => 8,
            ],
            [
                'id' => 59,
                'name_ua' => 'Непланове знеструмлення будинку, квартири',
                'parent_id' => 8,
            ],
            [
                'id' => 60,
                'name_ua' => 'Інше',
                'parent_id' => 8,
            ],
            //
            [
                'id' => 61,
                'name_ua' => 'Інше',
                'parent_id' => 9,
            ],
        ]);
    }
}
